// Задача 29: Напишите программу, 
// 1. которая задаёт массив из 8 элементов и
// 2. выводит их на экран./

// 1, 2, 5, 7, 19, 6, 1, 33 -> [1, 2, 5, 7, 19, 6, 1, 33]

Console.WriteLine("1, 2, 5, 7, 19, 6, 1, 33");
Convert.ToInt32(Console.ReadLine());

void Metod(string msg)
{
    Console.WriteLine(msg);
} 
Metod("[]");