// Напишите программу, которая принимает на вход цифру,
// обозначающую день недели,
// и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

int [] arrey = {1, 2, 3, 4, 5, 6, 7};
int n = arrey.Length;
int find = 6;
 if (find < 6)  Console.WriteLine(" --> {working day}");
 else Console.WriteLine(" --> {weekend}");

